// Description
// ในการทดสอบครั้งหนึ่ง มีข้อสอบ 2 ตอน (Part1 และ Part2 ) โดยแต่ละตอนคะแนนเต็ม 50 คะแนน คะแนนรวม 2 ตอนเป็น 100 คะแนน
// ผลการสอบ มีเกณฑ์ดังนี้ 
// Excellent คือ สอบผ่านได้คะแนนดีเยี่ยม เมื่อคะแนนรวมทั้งสองตอน ได้คะแนนตั้งแต่ 80 ขึ้นไป  
// Pass คือ สอบผ่าน ได้คะแนน รวมตั้งแต่ 60 คะแนนขึ้นไป (แต่น้อยกว่า 80) และ จะต้องได้คะแนน แต่ละตอนไม่ต่ำกว่า 25 คะแนน 
// Fail คือ สอบตก ได้คะแนนรวม ต่ำกว่า 60 หรือ คะแนนตอนใดตอนหนึ่ง ต่ำกว่า 25 คะแนน 
// เช่น ถ้าได้คะแนน 26 และ 30 ถือว่า Fail  , คะแนน 22 และ 48 ถือว่า Fail , คะแนน 35 25 ถือว่า Pass, คะแนน 46 และ 36 ถือว่า Excellent 

// Input
// จำนวนเต็ม 2 จำนวน คือคะแนนสอบของ Part1 กับ Part 2

// Output
// พิมพ์ผลการสอบ ตามเกณฑ์ที่กำหนดข้างต้น 
// Excellent  หรือ Pass หรือ Fail

// Hint
#include <stdio.h>
#include <stdlib.h>

int main()
{
    int p1, p2, sum;
    scanf("%d %d", &p1, &p2);
    sum = p1 + p2;
    if( sum >= 80)
        printf("Excellent");
    else if( sum >= 60 && p1 >= 25 && p2 >= 25)
        printf("Pass");
    else
        printf("Fail");
    exit(EXIT_SUCCESS);
}