// Description
// โปรแกรมคำนวณค่าบริการจอดรถ(parking fee) โดยคิดค่าบริการตามระยะเวลา ดังนี้ 
// - เวลาจอด ไม่เกิน 15 นาที ค่าบริการ 0 บาท 
// - ถ้าเศษ นาที เกินกว่า 15 นาที คิดเพิ่มเป็น 1 ชั่วโมง
// - เวลาจอด 1 - 4 ชั่วโมง คิดค่าบริการ 50 บาท 
// - ชั่วโมงถัดไป จาก 4 ชั่วโมงแรก คิดค่าบริการ ชั่วโมงละ 10 บาท 
// เช่น 
// เวลาจอด 1 ชั่วโมง 30 นาที  ค่าบริการ(fee) = 50 บาท 
// เวลาจอด 4 ชั่วโมง 16 นาที  ค่าบริการ(fee) = 60 บาท 
// เวลาจอด 5 ชั่วโมง 15 นาที  ค่าบริการ(fee) = 60 บาท 
// เวลาจอด 6 ชั่วโมง 20 นาที  ค่าบริการ(fee) = 80 บาท 
 

// Input
// อินพุตคือเวลาที่จอดรถ ประกอบด้วยจำนวนเต็มสองตัว คือ จำนวนชั่วโมง และ จำนวนนาที 

// Output
// ค่าบริการที่จอดรถ (Fee) ที่คำนวณได้ 

// Hint
// - อย่าลืมว่า ถ้าจอดไม่เกิน 15 นาที ค่าบริการเป็น 0 บาท
#include <stdio.h>
#include <stdlib.h>

int main()
{   int hour, minute;
    int fee;
    scanf("%d %d", &hour, &minute);
    if(minute <= 15)
        fee=0;
    else
        hour++;
    if(hour >= 1 && hour <= 4)
        fee=50;
    if(hour > 4)
        fee= 50 + (hour-4)*10;
    printf("%d", fee);

    exit(EXIT_SUCCESS);
}