// Description
// ให้หาผลรวมของตัวเลข 6 หลักสุดท้าย จากตัวเลขประจำตัวประชาชน 13 หลัก เมื่อหาผลรวมแล้ว อาจได้ค่าเกินที่มากกว่าหรือเท่ากับ 10 (แต่ค่าจะไม่เกิน 54 ทำไม?) ให้หาผลรวมของตัวเลข 2 หลักนั้นอีก จนกว่าจะได้ค่าเป็นตัวเลขหลักเดียว   เช่น 
// 123456 --> 1+2+3+4+5+6 = 21 --> 2+1 = 3
// 500100 --> 5+0+0+1+0+0 = 6
// 999994 --> 9+9+9+9+9+4 = 49 --> 4+9 = 13 --> 1+3 = 4  
// 995997 --> 9+9+5+9+9+7 = 48 --> 4+8 = 12 --> 1+2 = 3

// Input
// จำนวนเต็ม 1 ค่า (ตัวเลข 6 หลักสุดท้าย จากบัตรประชาชน)

// Output
// ตัวเลขหลักเดียว ซึ่งเป็นผลรวมของตัวเลขจากอินพุต (หากได้ผลรวมมากกว่า 1 หลัก ก็ให้เอาตัวเลขมาบวกกันอีกจนเหลือหลักเดียว)

// Hint
// - แยกตัวเลข แต่ละหลัก ใช้หลักการ mod 10 เพื่อเอาหลักหน่วย และ หาร 10 เพื่อตัดหลักหน่วยทิ้ง 
// - เมื่อหาผลรวม ได้แล้ว หากมีค่าเกิน 9 ให้หาผลรวมของตัวเลข 2 หลัก แล้วทดสอบอีกครั้ง ถ้ามีค่าเกิน 9 อีก ให้หาผลรวมอีกครั้ง ครั้งสุดท้ายนี้จะได้ค่าไม่เกิน 9 แน่นอน (ทำไม?)

// - ไม่ต้องใช้โครงสร้าง loop หรือการทำซ้ำ
#include <stdio.h>
#include <stdlib.h>

int main()
{
    int digit;
    int d1, d2, d3, d4, d5, d6;
    int sum_d;
    scanf("%d", &digit);
    d1 = digit/100000;
    d2 = digit%100000 /10000;
    d3 = digit%10000 /1000;
    d4 = digit%1000 /100;
    d5 = digit%100 /10;
    d6 = digit%10;
    sum_d = d1 + d2 + d3 + d4 + d5 +d6;
    if(sum_d >= 10){
        d1 = sum_d/10;
        d2 = sum_d%10;
        sum_d = d1 + d2;
        if( sum_d >= 10)
            printf("%d", (sum_d/10)+(sum_d%10));
        else
            printf("%d", sum_d);
    }
    else
        printf("%d", sum_d);

    exit(EXIT_SUCCESS);
}