// Description
// ในการแข่งขันวิ่งงานหนึ่ง มีการจับเวลาเป็นจำนวนวินาที ให้เขียนโปรแกรมแปลงจากวินาที เป็นหน่วย ชั่วโมง : นาที : วินาที  เช่น 
// 1000 วินาที คิดเป็น  0:16:40 
// 70 วินาที คิดเป็น  0:1:10 
// 18605 วินาที คิดเป็น 5:10:5  เป็นต้น


// Input
// จำนวนเต็มบวกหนึ่งค่า ซึ่งเป็นจำนวนวินาที เช่น 120

// Output
// จำนวนเต็ม 3 ค่า ในรูปแบบ hr:min:sec ซึ่งเป็น จำนวนชั่วโมง นาที และ วินาที ที่คำนวณได้ จากจำนวนวินาทีที่รับเข้ามา เช่น 0:2:0

// Hint
// - ใช้ operator หาร และ mod 
#include <stdio.h>
#include <stdlib.h>

int main()
{
    int num;
    int hour, minute, second;
    scanf("%d", &num);
    hour = num/3600;
    minute = (num-(3600*hour))/60;
    second = num%60;
    printf("%d:%d:%d", hour, minute, second);
    exit(EXIT_SUCCESS);
}