// Description
// ในการซื้อของในร้านค้าแห่งหนึ่ง มีการซื้อสินค้า n รายการ เมื่อรับราคาของสินค้าแต่ละรายการครบแล้ว ให้คำนวณราคารวมทั้งหมด และคำนวณราคา หลังจากหักส่วนลดให้ 5% ให้แสดงผลลัพธ์เป็นเลขทศนิยม 2 ตำแหน่ง 

// Input
// จำนวนแรก เป็นจำนวนเต็มบวก n 
// และมีค่าจำนวนจริงอีก n ค่า เป็นราคาของสินค้า n รายการที่ซื้อ 

// Output
// ผลลัพธ์ มีสองบรรทัด บรรทัดแรก คือ ราคารวมของสินค้าที่ซื้อ และ บรรทัดที่สอง คือ ราคารวมหลักจากหักส่วนลด 5% ให้แสดงเป็นเลขทศนิยมสองตำแหน่ง 

// Hint
// - เมื่อรับค่า n แล้วให้วนลูป n รอบ เพื่อรับค่าราคาสินค้า พร้อมคำนวณผลรวมไปด้วย 
#include <stdio.h>
#include <stdlib.h>

int main()
{
    int n;
    float price, sum;
    int i;
    scanf("%d", &n);
    for(i=0; i<n; i++){
        scanf(" %f", &price);
        sum+=price;
    }
    printf("%.2f\n", sum);
    printf("%.2f", sum*95/100);
    exit(EXIT_SUCCESS);
}