// Description
// โปรแกรมรับจำนวนเต็ม จนกว่าจะเจอค่า 0 หรือ ค่าติดลบจึงหยุดรับ แล้วแสดงผลลัพธ์ 3 อย่าง คือ จำนวนข้อมูลที่รับเข้ามา (count), ค่าที่น้อยที่สุด (min) และ ค่าที่มากที่สุด (max) ซึ่งไม่นับรวมตัวสุดท้ายที่เป็น 0 หรือ ค่าติดลบ เช่น 
// ข้อมูลนำเข้า(input): 
//   58 12 63 95 23 -3
// ผลลัพธ์ (output): 
//   5 
//   12 
//   95

// Input
// จำนวนเต็ม หลายๆ ค่า จบด้วยค่าสุดท้าย เป็น 0 หรือ จำนวนติดลบ

// Output
// แสดงผลลัพธ์ ค่า count min และ max ในสามบรรทัด ตามลำดับ

// Hint
// - ให้รับข้อมูลแรกเข้ามาก่อน แล้วกำหนดเป็นค่าเริ่มต้นให้กับ min และ max 
// - ใช้ลูป while หรือ do-while วนรับข้อมูล ถ้าเป็นค่าที่มากกว่า 0 ให้วนซ้ำไปเรื่อยๆ (ลูปจะจบเมื่อใส่ค่า 0 หรือ ค่าติดลบ)
#include <stdio.h>
#include <stdlib.h>

int main()
{
    int n;
    int count = 0, min, max;
    scanf("%d", &n);
    if(n>0)
        count = 1;
    min = n;
    max = n;
    while(n>0){
        scanf("%d", &n);
        if(n < 0)
            break;
        count++;
        if(n < min)
            min = n;
        if(n > max)
            max = n;
    }
    printf("%d\n", count);
    printf("%d\n", min);
    printf("%d", max);
    exit(EXIT_SUCCESS);
}