// Description
// โปรแกรมรับ text หรือ ข้อความเข้ามา จนกว่าจะพบ # จึงหยุด และให้สรุปว่า นับว่ามีจำนวนอักขระ ที่รับมาทั้งหมดมีกี่ตัว (Count) โดยไม่รวมอักระช่องว่างหรือตัวขึ้นบรรทัดใหม่, สรุปจำนวนตัวอักษร หรือ Letter (A-Z และ a-z) มีจำนวนกี่ตัว และสรุปจำนวนตัวเลข หรือ Digit ว่ามีกี่ตัว  เช่น 
// ข้อความอินพุต
// Hello 911
// Bye!    # 

 

// ผลลัพธ์ 
// Count: 13
// Letter: 8
// Digit: 3

// เป็นต้น

// Input
// text หรือ ข้อความ อาจมีหนึ่งบรรทัด หรือ หลายบรรทัด จบด้วย # เป็นตัวอักษรสุดท้าย

// Output
// ผลลัพธ์มี 3 บรรทัด คือ จำนวนตัวอักขระที่นับได้ (Count) ไม่รวมช่องว่างหรือตัวขึ้นบรรทัดใหม่ , จำนวนอักษร(Letter) และ จำนวนตัวเลข (Digit) ดังรูปแบบนี้  
// Count: x
// Letter: y
// Digit: z 
// หมายเหตุ x, y, z คือ จำนวนเต็ม ที่เป็นผลลัพธ์

// Hint
// - รับอักขระทีละตัว แบบไม่เอาช่องว่าง ให้ให้คำสั่ง scanf ดังนี้ เช่น 
//        char x; 
//        scanf("  %c", &x);  // ให้ใส่ช่องว่างไว้ข้างหน้า %c  
// - ใช้ do-while วนรับตัวอักษร จนกว่าจะเจอ #  เช่น 
//       do { .... scanf("   %c", &x); .... } while (x != '#'); 
#include <stdio.h>
#include <stdlib.h>

int main()
{
    char c;
    int count = 0;
    int letter = 0, digit = 0;
    do{
        scanf(" %c", &c);
        if(c != ' ' && c != '\n' && c != '\t')
            count++;
        if( (c >= 'a' && c <= 'z') || (c >= 'A' && c <= 'Z') )
            letter++;
        else if(c >= '0' && c <= '9')
            digit++;
    }while(c != '#');
    printf("Count: %d\n", count);
    printf("Letter: %d\n", letter);
    printf("Digit: %d", digit);
    exit(EXIT_SUCCESS);
}