// Description
// อนุกรม ตัวเลขชุดหนึ่งเริ่มต้นด้วย 1 แล้วค่าถัดไปให้ +1 และ +2 , +3,  +4,... จากค่าก่อนหน้า ไปเรื่อยๆ 
// 1 2 4 7 11 16 22 29 ...


// จงแสดงตัวเลขของอนุกรมนี้ โดยมีค่าไม่เกิน n เช่น n = 100 จะได้อนุกรม 
// 1 2 4 7 11 16 22 29 37 46 56 67 79 92 

// เป็นต้น

// Input
// ค่าของ n เป็นจำนวนเต็มบวก หนึ่งจำนวน ค่าสูงสุดในอนุกรม จะมีค่าไม่เกิน n

// Output
// พิมพ์ตัวเลขในอนุกรมนี้ ตามลำดับ จาก 1 จนถึงค่าไม่เกิน n

// Hint
#include <stdio.h>
#include <stdlib.h>

int main()
{
    int n;
    int i;
    int sum = 1;
    scanf("%d", &n);
    for(i=1; sum<=n; i++){
        printf("%d ", sum);
        sum+=i;
    }
    exit(EXIT_SUCCESS);
}