// Description
// จงเขียนโปแกรมพิมพ์ เครื่องหมายดอกจัน(star or asterisk) ให้เป็นรูปกากบาท (X) ซึ่งมีจำนวนบรรทัด เท่ากับ n เช่น n = 5 จะได้ผลลัพธ์ดังรูป 
// *     *
//  *   * 
//    * 
//  *  * 
// *     *
   

// เป็นต้น

// Input
// อินพุตคือ จำนวนเต็มบวกหนึ่งค่า (ค่า n)

// Output
// พิมพ์รูปดาว เป็นกากบาท มีจำนวนบรรทัดเท่ากับค่า n  ดังตัวอย่าง 

//  เช่น n = 6 จะได้ผลลัพธ์ดังรูป 
// *       *
//  *    *
//    **
//    **
//   *   *
// *       *
     

// เป็นต้น

// Hint
// - โปรแกรมใช้ลูปสองชั้น 
#include <stdio.h>
#include <stdlib.h>

int main()
{   int n;
    int i, j;
    scanf("%d", &n);
    for(i=0; i<n; i++){
        for(j=0; j<n; j++){
            if(j == i || j == n-i-1)
                printf("*");
            else
                printf(" ");
        }
        printf("\n");
    }

    exit(EXIT_SUCCESS);
}