// Description
// ID code หรือรหัสประจำตัว ในประเทศไทย ใช้รหัสตัวเลข 13 หลัก (เลขบัตรประชาชน) ในระบบออนไลน์แห่งหนึ่ง จะกำหนดใช้ ID code เป็น user login และจะมีการกำหนด default password หรือ ค่ารหัสผ่านเริ่มต้น เป็นตัวเลข 4 หลัก หรือ PIN (Personal Identification Number) ซึ่ง user จะสามารถเข้ามาเปลี่ยน password ได้ในภายหลัง 
// การสร้าง PIN เป็นตัวเลข 4 หลัก จะใช้ข้อมูลจาก ID code โดยใช้หลักการดังนี้ ตัวเลขสองหลักแรกของ PIN ได้มาจากผลรวมของตัวเลข 6 หลักบนของ ID (ถ้าผลรวมเป็นตัวเลขหลักเดียว ให้เติมศูนย์ด้านหน้า) และ ตัวเลขสองหลักสุดท้ายของ PIN ได้มาจากผลรวมของตัวเลข 7 หลักล่างของ ID (ถ้าผลรวมเป็นตัวเลขหลักเดียว ให้เติมศูนย์ด้านหน้า) เช่น 
// นาย ก นามสมมุติ มี ID code เป็น 1234567890123 จะมี PIN คือ 2130 เพราะ 
// ตัวเลขสองหลักแรกได้มาจาก 1+2+3+4+5+6 = 21 
// และ สองหลักสุดท้ายได้มาจาก 7+8+9+0+1+2+3 = 30

// Input
// อินพุตคือรหัส ID code 13 หลัก แบ่งเป็น จำนวนเต็ม 2 ตัว คือ ตัวเลข 6 หลักบน และ 7 หลักล่างตามลำดับ (คั่นด้วยเว้นวรรค) เช่น 
// 123456 7890123 เป็นต้น 


// Output
// รหัส PIN 4 หลัก

// Hint
// -- ให้รับอินพุต เป็นจำนวนเต็ม 2 ค่า เช่น  int m, n;  scanf("%d %d", &m, &n); 
// -- แยกคำนวณ PIN ตัวเลข สองหลักบน และ สองหลักล่าง จากค่า m และ n ตามลำดับ 
#include <stdio.h>
#include <stdlib.h>

int main()
{
    int m, n;
    int m1, m2, m3, m4, m5, m6;
    int n1, n2, n3, n4, n5, n6, n7;
    int sumM, sumN;
    scanf("%d %d", &m, &n); 
    m1 = m/100000;
    m2 = m%100000 /10000;
    m3 = m%10000 /1000;
    m4 = m%1000 /100;
    m5 = m%100 /10;
    m6 = m%10;
    sumM = m1 + m2 + m3 + m4 + m5 + m6;
    n1 = n/1000000;
    n2 = n%1000000 /100000;
    n3 = n%100000 /10000;
    n4 = n%10000 /1000;
    n5 = n%1000 /100;
    n6 = n%100 /10;
    n7 = n%10;
    sumN = n1 + n2 + n3 + n4 + n5 + n6 + n7;
    printf("%02d%02d", sumM, sumN);
    
    exit(EXIT_SUCCESS);
}