// Description
// โดยทั่วไป เวลาสากล นิยมเขียนใน 2 ระบบ คือระบบเวลา แบบ 24 ชั่วโมง และ ระบบ AMPM เช่น 
// เวลาเที่ยงคืนตรง (หรือเริ่มต้นวัน) แบบ 24 ชั่วโมง เขียนเป็น 00:00  หรือตรงกับ 12:00 a.m. ในระบบ AMPM
// เที่ยงคืนครึ่ง แบบ 24 ชั่วโมง เขียนเป็น 00:30 หรือตรงกับ 12:30 a.m. ในระบบ AMPM 
// ตีหนึ่งห้านาที แบบ 24 ชั่วโมง เขียนเป็น 01:05 หรือตรงกับ 01:05 a.m. ในระบบ AMPM  
// แปดโมงเช้า แบบ 24 ชั่วโมง เขียนเป็น 08:00 หรือตรงกับ 08:00 a.m. ในระบบ AMPM  
// เที่ยงวัน แบบ 24 ชั่วโมง เขียนเป็น 12:00 หรือตรงกับ 12:00 p.m. ในระบบ AMPM  
// เที่ยงครึ่ง  แบบ 24 ชั่วโมง เขียนเป็น 12:30 หรือตรงกับ 12:30 p.m. ในระบบ AMPM  
// บ่ายโมงสิบนาที เที่ยงวัน แบบ 24 ชั่วโมง เขียนเป็น 13:10 หรือตรงกับ 01:10 p.m. ในระบบ AMPM  
// หกโมงเย็น เที่ยงวัน แบบ 24 ชั่วโมง เขียนเป็น 18:00 หรือตรงกับ 06:00 p.m. ในระบบ AMPM  
// ห้าทุ่มห้าสิบนาที เที่ยงวัน แบบ 24 ชั่วโมง เขียนเป็น 23:50 หรือตรงกับ 11:50 p.m. ในระบบ AMPM  
// เป็นต้น 
// จงเขียนโปรแกรม แปลงเวลาจากระบบ 24 ชั่วโมง เป็นระบบ AMPM

// Input
// hh:mm อินพุตคือจำนวนเต็มระบุชั่วโมงและนาที ซึ่งคั่นด้วยเครื่องหมาย :

// Output
// hh:mm a.m. หรือ  hh:mm p.m. คือเวลาที่แปลงเป็นระบบ AMPM มี a.m. หรือ p.m. ข้างท้าย 

// Hint
// -- ให้รับข้อมูล จำนวนเต็มสองค่า ตามรูปแบบเวลา hh:mm ดังนี้ 
//    int hh,mm;  scanf("%d:%d", &hh, &mm); 
// -- ใช้เครื่องหมาย : คั่นระหว่าง ชั่วโมง กับ นาที 
// -- แสดงค่า ชัวโมงและนาที เป็นตัวเลข 2 หลัก 
// -- ตรวจสอบค่า hh ว่าอยู่ในช่วงเวลาใด แล้วแปลงเป็น a.m. หรือ p.m. ให้ถูกต้อง
#include <stdio.h>
#include <stdlib.h>

int main()
{
    int hh,mm;
    scanf("%d:%d", &hh, &mm);
    if(hh == 0)
        printf("12:%02d a.m.",mm);
    else if(hh == 12)
        printf("12:%02d p.m.",mm);
    else if(hh > 12)
        printf("%02d:%02d p.m.", hh-12, mm);
    else if(hh < 12)
        printf("%02d:%02d a.m.", hh, mm);
    exit(EXIT_SUCCESS);
}