// Description
// โปรแกรมรับจำนวนเต็ม n เป็นจำนวน แล้วพิพม์ค่ากำลังสองของจำนวนเต็มที่รับเข้ามา จากหลังไปหน้า (พิมพ์จำนวนที่รับมาหลังสุดก่อนจนไปถึงจำนวนแรก) เช่น 
// n = 5 
// จำนวนที่รับเข้ามา 10 7 9 3 5 
// ผลลัพธ์ 25 9 81 49 100 
// เป็นต้น

// Input
// ค่าแรกคือ ค่า n เป็นจำนวนเต็มบวก(มีค่าไม่เกิน 100) จากนั้นจะมีจำนวนเต็มอีก n จำนวน  

// Output
// พิมพ์ค่าข้อมูล n จำนวน จากหลังมาหน้า ของลำดับการรับข้อมูล แต่ละค่าข้อมูลให้เว้นวรรคหนึ่งช่อง

// Hint
// -- ประกาศอาร์เรย์ชนิด int ไว้สำหรับเก็บข้อมูลที่รับเข้ามา กำหนดความยาวอาร์เรย์ เป็น 100 แต่อาจใช้ข้อมูลจริง ไม่ถึง 100 เช่น int a[100]; 
// -- รับค่า n เข้ามาก่อน แล้ววนลูปรับค่าข้อมูล n ตัว เก็บไว้ในอาร์เรย์ จาก a[0] จนถึง a[n-1] 
// -- แสดงผลลัพธ์ที่ได้จากค่าข้อมูลของอาร์เรย์ จากลำดับหลังไปหน้า คือ จาก n-1 จนถึง 0
#include <stdio.h>
#include <stdlib.h>

int main()
{   
    int n;
    int a[100];
    int i;
    scanf("%d", &n);
    for(i=0; i<n; i++){
        scanf(" %d", &a[i]);
    }
    for(i=n-1; i>=0; i--){
        printf("%d ",a[i]*a[i]);
    }
    exit(EXIT_SUCCESS);
}