// Description
// ในการประเมินการเรียนคอร์สหนึ่ง มีคะแนนเต็ม 100 คะแนน ผู้ที่ผ่านจะต้องได้คะแนนไม่ต่ำกว่า 50 จาก คะแนนของนักเรียน 10 คน ให้เขียนโปรแกรม สรุปว่า มีใครผ่านบ้าง และมีใครไม่ผ่าน และคะแนนเฉลี่ยเป็นเท่าไหร่ 
// เช่น มีคะแนนของนักเรียน 10 คน ดังนี้ 
// 65 48 71 80 52 76 87 58 69 60
// สรุปได้ดังนี้ 
// คนสอบผ่าน Pass: 65 71 80 52 76 87 58 69 60
// คนสอบไม่ผ่าน Fail: 48
// คะแนนเฉลี่ย Average: 66.60

// Input
// จำนวนเต็ม 10 ค่า ซึ่งเป็นคะแนนของนักเรียน 10 คน

// Output
// ผลลัพธ์มี 3 บรรทัด 
// Pass: ตามด้วยคะแนนของนักเรียนทุกคนที่สอบผ่าน (ตามลำดับของอินพุต)
// Fail: ตามด้วยคะแนนของนักเรียนทุกคนที่สอบไม่ผ่าน (ตามลำดับของอินพุต) 
// Average: ค่าเฉลี่ยของคะแนนของนักเรียน 10 คน เป็นเลขทศนิยม 2 หลัก

// Hint
#include <stdio.h>
#include <stdlib.h>

int main()
{
    int scores[10];
    int sumScores = 0;
    float average;
    int i;
    for(i=0; i<10; i++){
        scanf(" %d", &scores[i]);
        sumScores+=scores[i];
    }
    printf("Pass: ");
    for(i=0; i<10; i++)
        if(scores[i]>=50)
            printf("%d ",scores[i]);
    printf("\nFail: ");
    for(i=0; i<10; i++)
        if(scores[i]<50)
            printf("%d ",scores[i]);
    average = (float)sumScores/10;  
    printf("\nAverage: %.2f", average);

    exit(EXIT_SUCCESS);
}