// Description
// สมมุติคุณมีฟาร์มเล็กๆเลี้ยงไก่ไข่ เพื่อเก็บไข่กินเองในครัวเรือนตามหลักปรัชญาเศรษฐกิจพอเพียง มีการจดบันทึกจำนวนไข่ที่เก็บได้ในแต่ละวัน จงเขียนโปรแกรม รับข้อมูลจำนวนไข่ที่เก็บได้ในแต่ละวันในสัปดาห์ (แต่ละสัปดาห์เริ่มต้นจากวันจันทร์) เป็นจำนวน 4 สัปดาห์ แล้วโปรแกรมจะสรุป จำนวนไข่ที่เก็บได้ในแต่ละสัปดาห์ พร้อมทั้งสรุปว่า วันใดเก็บไข่รวมได้เป็นจำนวนมากที่สุด

 

// Input
// จำนวนไข่ ที่เก็บได้ในแต่ละวันของสัปดาห์ ตามลำดับ(เริ่มจากวันจันทร์ Monday, Tuesday, ... ถึง วันอาทิตย์ Sunday) มีข้อมูล 4 สัปดาห์ เช่น 
// 1 2 3 4 5 6 7
// 2 2 1 3 4 1 1
// 1 1 3 4 1 2 1
// 1 0 3 2 0 4 2

 

 

// Output
// สรุปจำนวนรวมของไข่ที่เก็บได้ในแต่ละสัปดาห์ และ วันไหนในสัปดาห์ที่เก็บไข่ได้มากที่สุด เช่น

// Week 1: 28
// Week 2: 14
// Week 3: 13
// Week 4: 12
// Max day: Thursday 13

// จากข้อมูลตัวอย่าง สรุปจำนวนรวมของแต่ละสัปดาห์ และ บรรทัดสุดท้าย สรุปวันที่เก็บไข่รวมกันได้มากที่สุด และจำนวนรวมของไข่ที่เก็บได้ในวันนั้น เช่น Thursday จากตัวอย่างได้จำนวนรวม = 13 ถ้ามีค่ามากที่สุดมากกว่าหนึ่งวัน ให้แสดงคำตอบเป็นวันที่มาก่อนเพียงวันเดียว

 

// Hint
// -- ใช้อาร์เรย์ 2 มิติ ขนาด 4x7 เก็บข้อมูล 4 สัปดาห์ 
// -- หาผลรวม ในแต่ละแถว (ผลรวมรายสัปดาห์) และผลรวมในแต่ละคอลัมน์
#include <stdio.h>
#include <stdlib.h>

int main()
{
    int sum_egg_per_week[4];
    int sum_egg_per_day[7] = {0};
    int eggs;
    int sum;
    int i,j;
    char week[][20] = {
        "Monday", "Tuesday", "Wednesday", "Thursday", "Friday", "Saturday", "Sunday"
    };
    for(i=0; i<4; i++){
        sum = 0;
        for(j=0; j<7; j++){
            scanf("%d",&eggs);
            sum_egg_per_day[j]+=eggs;
            sum+=eggs;
        }
        sum_egg_per_week[i] = sum;
    }
    int max = sum_egg_per_day[0];
    int index = 0;
    for(i=0; i<7; i++)
        if(max < sum_egg_per_day[i]){
            max = sum_egg_per_day[i];
            index = i;
        }
    for(i=0; i<4; i++)
        printf("Week %d: %d\n", i+1, sum_egg_per_week[i]);
    printf("Max day: %s %d", week[index], max);

    exit(EXIT_SUCCESS);
}